In [2]:
import pandas as pd
import numpy as np

# Data Cleaning

In [3]:
arr1 = np.array([[2,4,5,6,1],[7,3,9,np.nan,3],[3,np.nan,4,np.nan,np.nan],[np.nan,3,2,1,7]])
arr2 = np.array(['A','B','C','D'])
arr3 = np.array(['U','V','W','X','Y'])

In [4]:
dtf = pd.DataFrame(data = arr1, index = arr2, columns = arr3)
dtf

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [5]:
dtf.loc['D'].mean()

3.25

In [6]:
dtf.mean()

U    4.000000
V    3.333333
W    5.000000
X    3.500000
Y    3.666667
dtype: float64

In [7]:
#Clean the NAN Value for this Datas
dtf.dropna()

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0

In [8]:
dtf

     U    V    W    X    Y
A  2.0  4.0  5.0  6.0  1.0
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  2.0  1.0  7.0

In [9]:
b= dtf[dtf>2]

In [10]:
b.fillna('pre')

     U    V    W    X    Y
A  pre    4    5    6  pre
B    7    3    9  pre    3
C    3  pre    4  pre  pre
D  pre    3  pre  pre    7

In [11]:
b

     U    V    W    X    Y
A  NaN  4.0  5.0  6.0  NaN
B  7.0  3.0  9.0  NaN  3.0
C  3.0  NaN  4.0  NaN  NaN
D  NaN  3.0  NaN  NaN  7.0

In [27]:
b.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [A, B, C, D]

# Creating a Dictionary

In [13]:
narr = {
    "COMPANY":["GOOG","GOOG","FB","FB","BDCL","BDCL"],
    "PERSON": ["Precious", "Ndidi", "Gbenga", "Grace", "Ola", "Don"],
    "SCORE":  [600,400,500,344,100,50]
}

In [14]:
dic = pd.DataFrame(narr)
dic

  COMPANY    PERSON  SCORE
0    GOOG  Precious    600
1    GOOG     Ndidi    400
2      FB    Gbenga    500
3      FB     Grace    344
4    BDCL       Ola    100
5    BDCL       Don     50

In [15]:
dic.mean()

SCORE    332.333333
dtype: float64

In [16]:
dic.describe()

            SCORE
count    6.000000
mean   332.333333
std    218.249093
min     50.000000
25%    161.000000
50%    372.000000
75%    475.000000
max    600.000000

In [17]:
dic[["PERSON"]]

     PERSON
0  Precious
1     Ndidi
2    Gbenga
3     Grace
4       Ola
5       Don

In [18]:
dic[["PERSON"]].count()

PERSON    6
dtype: int64

In [19]:
dic

  COMPANY    PERSON  SCORE
0    GOOG  Precious    600
1    GOOG     Ndidi    400
2      FB    Gbenga    500
3      FB     Grace    344
4    BDCL       Ola    100
5    BDCL       Don     50

In [20]:
dic.iloc[4]

COMPANY    BDCL
PERSON      Ola
SCORE       100
Name: 4, dtype: object

In [21]:
grpComp = dic.groupby('COMPANY')

In [22]:
grpComp

In [23]:
grpComp.sum()

         SCORE
COMPANY
BDCL       150
FB         844
GOOG      1000

In [24]:
dic[['SCORE']]

   SCORE
0    600
1    400
2    500
3    344
4    100
5     50

In [25]:
dic['SCORE'].unique()

array([600, 400, 500, 344, 100,  50], dtype=int64)

In [26]:
dic['SCORE'].nunique()

6